app/controllers/category_controller.rb

  def create
    @category = Category.new(params[:category])
    if @category.save
---
INSERT INTO "categories" ("name", "updated_at", "created_at") VALUES('Funny', '2010-03-05 05:26:36', '2010-03-05 05:26:36')

  def update
    Category.update(params[:category][:id],params[:category])
---
UPDATE "categories" SET "name" = 'Hockey', "updated_at" = '2010-03-08 00:21:08' WHERE "id" = 3

  def destroy
    category = Category.find(params[:id])
    flash[:message] = "#{category[:name]} has be removed"
    category.destroy
---
SELECT * FROM "categories" WHERE ("categories"."id" = 1)
DELETE FROM "categories" WHERE "id" = 1

  def list
    @questions = Category.find(params[:id]).questions
---
SELECT * FROM "categories" WHERE ("categories"."id" = 1)
SELECT * FROM "questions" INNER JOIN "categories_questions" ON "questions".id = "categories_questions".question_id WHERE ("categories_questions".category_id = 1 )

  def random
    category = Category.find(params[:id])
    @question = find_random(category.questions)
    if @question.nil?
      flash[:error] = "No more random questions in the #{category.name} category. You need to <a href='/category/clear_history/#{category[:id]}'>clear the #{category.name} history</a>."
      redirect_to :controller=>"category"
    else
      @question.last_asked = "#{Date.today}"
      @question.save
---
SELECT * FROM "categories" WHERE ("categories"."id" = 1)
UPDATE "questions" SET "updated_at" = '2010-03-08 02:02:24', "last_asked" = '2010-03-07' WHERE "id" = 2

  def clear_history
    category = Category.find(params[:id])
    category.questions.each do |question|
      question.last_asked = ""
      question.save
---
SELECT * FROM "categories" WHERE ("categories"."id" = 1)
SELECT * FROM "questions" INNER JOIN "categories_questions" ON "questions".id = "categories_questions".question_id WHERE ("categories_questions".category_id = 1 )
UPDATE "questions" SET "updated_at" = '2010-03-08 02:13:12', "last_asked" = '' WHERE "id" = 1