app/controllers/question_controller.rb

  def create
    @question = Question.new(params[:question])
    if @question.save
---
INSERT INTO "questions" ("answer", "updated_at", "last_asked", "question", "created_at") VALUES('Barry Bonds', '2010-03-08 01:46:40', NULL, 'Who is baseball''s all-time home run leader?', '2010-03-08 01:46:40')

  def edit
    @question = Question.find(params[:id])
---
SELECT * FROM "questions" WHERE ("questions"."id" = 2)

  def update
    params[:question][:category_ids] ||= []
    Question.update(params[:question][:id],params[:question])
---
UPDATE "questions" SET "answer" = 'Jessie To the Keck', "question" = 'What is your new name?', "updated_at" = '2010-03-05 05:01:37' WHERE "id" = 2

  def destroy
    question = Question.find(params[:id])
    flash[:message] = "#{question[:question]} has be removed"
    question.destroy
---
SELECT * FROM "questions" WHERE ("questions"."id" = 1)
DELETE FROM "questions" WHERE "id" = 1

  def clear_history
    question = Question.find(params[:id])
    question.last_asked = ""
    question.save
---
SELECT * FROM "questions" WHERE ("questions"."id" = 1)
UPDATE "questions" SET "updated_at" = '2010-03-08 06:07:02', "last_asked" = '' WHERE "id" = 2

  def clear_all_history
    Question.update_all("last_asked = ''")
---
UPDATE "questions" SET last_asked = ''

  def random
    @question = find_random(Question.find(:all))
    if @question.nil?
      flash[:error] = "No more random questions.  You should <a href='/question/clear_all_history'>clear your history</a>."
      redirect_to root_path
    else
      @question.last_asked = "#{Date.today}"
      @question.save
---
SELECT * FROM "questions" WHERE ("questions"."id" = 2)
UPDATE "questions" SET "updated_at" = '2010-03-08 04:26:11', "last_asked" = '2010-03-07' WHERE "id" = 1

  def search
    respond_to do |format|
      format.xml do
        render :layout=>false
      end
      format.html do
        if params[:type] == "autocomplete"
          query = params[:q].split(" ").join("%")
          @questions = Question.find(:all,:conditions=>['question LIKE ?', "%#{query}%"])
          q = [params[:q]]
          r = []
          @questions.each do |question|
---
SELECT * FROM "questions" WHERE (question LIKE '%What%')
SELECT * FROM "questions"